[
  {
    "reviewText": "Product came without the rubber bands pictured in the advertisement. Other than that it works.",
    "reviewTitle": "Came without the bands…",
    "reviewDate": "Reviewed in the United States on July 2, 2023",
    "reviewRating": "3.0 out of 5 stars",
    "reviewSentiment": 0
  },
  {
    "reviewText": "",
    "reviewTitle": "Convenient, sturdy and efficient design, works great as intended",
    "reviewDate": "Reviewed in the United States on April 9, 2022",
    "reviewRating": "4.0 out of 5 stars",
    "reviewSentiment": 0
  },
  {
    "reviewText": "The bolt used to tighten down the clamp that secures this mount got stripped after only a few uses. Would not recommend.",
    "reviewTitle": "Broke after 5-10 uses",
    "reviewDate": "Reviewed in the United States on August 7, 2023",
    "reviewRating": "2.0 out of 5 stars",
    "reviewSentiment": 0
  },
  {
    "reviewText": "the only thing i can comment on is magnet strength- and I truly am nitpicking when i say this but I do wish it was stronger. I put it on my mountain bike, so the off-road trails aren’t nice to the magnets. However their is a handy strap that secures the phone when the magnet isn’t enough. I ran this around the mountain bike trail and it held on absolutely tremendously. overall 9/10, only because the magnet could be stronger.",
    "reviewTitle": "A great product!",
    "reviewDate": "Reviewed in the United States on July 2, 2022",
    "reviewRating": "4.0 out of 5 stars",
    "reviewSentiment": 10
  },
  {
    "reviewText": "It holds phone great but it has to be tightened quite a bit to stay put. When I did tighten one time the butterfly spun cause it is plastic and the screw part is metal and the teeth that combine them are very small. I will be welding half a washer to make a new butterfly.",
    "reviewTitle": "Works but has a flaw",
    "reviewDate": "Reviewed in the United States on September 22, 2022",
    "reviewRating": "3.0 out of 5 stars",
    "reviewSentiment": 3
  },
  {
    "reviewText": "Mounted it to my Peleton bike handle so I can easily mount, rotate horizontal or vertically, and remove my phone with ease while riding. The magnet was plenty good to hold my iPhone 13 Pro MAX with a case (which is a pretty darn heavy phone!) without the need to use the elastic straps.",
    "reviewTitle": "Works great on my Peleton!",
    "reviewDate": "Reviewed in the United States on March 13, 2023",
    "reviewRating": "5.0 out of 5 stars",
    "reviewSentiment": 6
  },
  {
    "reviewText": "Every big pot hole or bump hit hard sent my phone flying down the road. Fortunately it didn’t get run over and I had a tracking app to locate it when my phone bounced into the weeds. Magnetic stick on ring came off the phone eventually.",
    "reviewTitle": "Great if you don’t hit bumps… phone flew off a lot.",
    "reviewDate": "Reviewed in the United States on August 13, 2022",
    "reviewRating": "3.0 out of 5 stars",
    "reviewSentiment": 2
  },
  {
    "reviewText": "I was using to secure the phone in a golf cart and the magnet seemed pretty strong but they always showed it with the rubber bands also hold the phone in place. There wasn't enough stretch in the rubber bands to fit my iphone 14 pro max. I wasn't going to chance it with just the magnet. The rubber bands are hard to utilize. Sorry but returned same.",
    "reviewTitle": "Really wanted to like this magsafe mount but too afraid to not use the rubber bands",
    "reviewDate": "Reviewed in the United States on December 24, 2022",
    "reviewRating": "2.0 out of 5 stars",
    "reviewSentiment": 6
  }
]